sergev/LiteBSD/sys/mips/pic32/machdep.c
    /*
     * Find out how much memory is available.
     * Be careful to save and restore the original contents for msgbuf.
     */
    /* Get total RAM size. */
    physmem = (512 * 1024) / NBPG;
    maxmem = physmem;


    /*
     * Initialize error message buffer (at end of core).
     */
    maxmem -= btoc(sizeof (struct msgbuf));
    msgbufp = (struct msgbuf *)(MACH_PHYS_TO_CACHED(maxmem << PGSHIFT));
    msgbufmapped = 1;

    /*
     * Allocate space for system data structures.
     * The first available kernel virtual address is in "v".
     * As pages of kernel virtual memory are allocated, "v" is incremented.
     *
     * These data structures are allocated here instead of cpu_startup()
     * because physical memory is directly addressable. We don't have
     * to map these into virtual address space.
     */
    start = v;

#define valloc(name, type, num) \
        (name) = (type *)v; v = (caddr_t)((name)+(num))
#define valloclim(name, type, num, lim) \
        (name) = (type *)v; v = (caddr_t)((lim) = ((name)+(num)))
    valloc(cfree, struct cblock, nclist);
    valloc(callout, struct callout, ncallout);
    valloc(swapmap, struct map, nswapmap = maxproc * 2);
#ifdef SYSVSHM
    valloc(shmsegs, struct shmid_ds, shminfo.shmmni);
#endif

    /*
     * Determine how many buffers to allocate.
     * We allocate more buffer space than the BSD standard of
     * using 10% of memory for the first 2 Meg, 5% of remaining.
     * We just allocate a flat 10%.  Ensure a minimum of 16 buffers.
     * We allocate 1/2 as many swap buffer headers as file i/o buffers.
     */
    if (bufpages == 0)
        bufpages = physmem / 10 / CLSIZE;
    if (nbuf == 0) {
        nbuf = bufpages;
        if (nbuf < 16)
            nbuf = 16;
    }
    if (nswbuf == 0) {
        nswbuf = (nbuf / 2) &~ 1;       /* force even */
        if (nswbuf > 256)
            nswbuf = 256;           /* sanity */
    }
    valloc(swbuf, struct buf, nswbuf);
    valloc(buf, struct buf, nbuf);

    /*
     * Clear allocated memory.
     */
    bzero(start, v - start);

    /*
     * Initialize the virtual memory system.
     */
    pmap_bootstrap((vm_offset_t)v);

    /*
     * Setup interrupt controller.
     *
     * Priority IRQ                     Devices
     * --------------------------------------------------------------
     *  1       Software interrupt 0    low-priority clock processing
     *  2       Software interrupt 1    network protocol processing
     *  3       SPI ports               disk controllers
     *  4       Ethernet                network device controllers
     *  5       UART ports              terminal multiplexers
     *  6       Core timer              high-priority clock processing
     */
    INTCON = 0;				/* Interrupt Control */
    IPTMR = 0;				/* Temporal Proximity Timer */

    /* Interrupt Flag Status */
    IFS(0) = 0;
    IFS(1) = 0;
    IFS(2) = 0;
    IFS(3) = 0;
    IFS(4) = 0;
    IFS(5) = 0;

    /* Interrupt Enable Control */
    IEC(0) = 0;
    IEC(1) = 0;
    IEC(2) = 0;
    IEC(3) = 0;
    IEC(4) = 0;
    IEC(5) = 0;

    /* Interrupt Priority Control */
    unsigned ipc = PIC32_IPC_IP0(1) | PIC32_IPC_IP1(1) |
                   PIC32_IPC_IP2(1) | PIC32_IPC_IP3(1);

    /* 0 - Core Timer Interrupt
     * 1 - Core Software Interrupt 0
     * 2 - Core Software Interrupt 1
     * 3 - External Interrupt 0 */
    IPC(0) = PIC32_IPC_IP0(6) | PIC32_IPC_IP1(1) | PIC32_IPC_IP2(2) | PIC32_IPC_IP3(0);
    IPC(1) = 0;
    IPC(2) = 0;
    IPC(3) = 0;
    IPC(4) = 0;
    IPC(5) = 0;
    IPC(6) = 0;
    IPC(7) = 0;
    IPC(8) = 0;
    IPC(9) = 0;
    IPC(10) = 0;
    IPC(11) = 0;
    IPC(12) = 0;
    IPC(13) = 0;
    IPC(14) = 0;
    IPC(15) = 0;
    IPC(16) = 0;
    IPC(17) = 0;
    IPC(18) = 0;
    IPC(19) = 0;
    IPC(20) = 0;
    IPC(21) = 0;
    IPC(22) = 0;
    IPC(23) = 0;
    IPC(24) = 0;
    IPC(25) = 0;
    IPC(26) = 0;

    /* 108 - Reserved
     * 109 - SPI1 Fault
     * 110 - SPI1 Receive Done
     * 111 - SPI1 Transfer Done */
    IPC(27) = PIC32_IPC_IP0(0) | PIC32_IPC_IP1(3) | PIC32_IPC_IP2(3) | PIC32_IPC_IP3(3);

    /* 112 - UART1 Fault
     * 113 - UART1 Receive Done
     * 114 - UART1 Transfer Done
     * 115 - I2C1 Bus Collision Event */
    IPC(28) = PIC32_IPC_IP0(5) | PIC32_IPC_IP1(5) | PIC32_IPC_IP2(5) | PIC32_IPC_IP3(0);
    IPC(29) = 0;
    IPC(30) = 0;
    IPC(31) = 0;
    IPC(32) = 0;
    IPC(33) = 0;
    IPC(34) = 0;

    /* 140 - DMA Channel 6
     * 141 - DMA Channel 7
     * 142 - SPI2 Fault
     * 143 - SPI2 Receive Done */
    IPC(35) = PIC32_IPC_IP0(0) | PIC32_IPC_IP1(0) | PIC32_IPC_IP2(3) | PIC32_IPC_IP3(3);

    /* 144 - SPI2 Transfer Done
     * 145 - UART2 Fault
     * 146 - UART2 Receive Done
     * 147 - UART2 Transfer Done */
    IPC(36) = PIC32_IPC_IP0(3) | PIC32_IPC_IP1(5) | PIC32_IPC_IP2(5) | PIC32_IPC_IP3(5);

    IPC(37) = 0;

    /* 152 - Control Area Network 2
     * 153 - Ethernet Interrupt
     * 154 - SPI3 Fault
     * 155 - SPI3 Receive Done */
    IPC(38) = PIC32_IPC_IP0(0) | PIC32_IPC_IP1(4) | PIC32_IPC_IP2(3) | PIC32_IPC_IP3(3);

    /* 156 - SPI3 Transfer Done
     * 157 - UART3 Fault
     * 158 - UART3 Receive Done
     * 159 - UART3 Transfer Done */
    IPC(39) = PIC32_IPC_IP0(3) | PIC32_IPC_IP1(5) | PIC32_IPC_IP2(5) | PIC32_IPC_IP3(5);

    /* 160 - I2C3 Bus Collision Event
     * 161 - I2C3 Slave Event
     * 162 - I2C3 Master Event
     * 163 - SPI4 Fault */
    IPC(40) = PIC32_IPC_IP0(0) | PIC32_IPC_IP1(0) | PIC32_IPC_IP2(0) | PIC32_IPC_IP3(3);

    /* 164 - SPI4 Receive Done
     * 165 - SPI4 Transfer Done
     * 166 - Real Time Clock
     * 167 - Flash Control Event */
    IPC(41) = PIC32_IPC_IP0(3) | PIC32_IPC_IP1(3) | PIC32_IPC_IP2(6) | PIC32_IPC_IP3(0);

    /* 168 - Prefetch Module SEC Event
     * 169 - SQI1 Event
     * 170 - UART4 Fault
     * 171 - UART4 Receive Done */
    IPC(42) = PIC32_IPC_IP0(0) | PIC32_IPC_IP1(0) | PIC32_IPC_IP2(5) | PIC32_IPC_IP3(5);

    /* 172 - UART4 Transfer Done
     * 173 - I2C4 Bus Collision Event
     * 174 - I2C4 Slave Event
     * 175 - I2C4 Master Event */
    IPC(43) = PIC32_IPC_IP0(5) | PIC32_IPC_IP1(0) | PIC32_IPC_IP2(0) | PIC32_IPC_IP3(0);

    /* 176 - SPI5 Fault
     * 177 - SPI5 Receive Done
     * 178 - SPI5 Transfer Done
     * 179 - UART5 Fault */
    IPC(44) = PIC32_IPC_IP0(3) | PIC32_IPC_IP1(3) | PIC32_IPC_IP2(3) | PIC32_IPC_IP3(5);

    /* 180 - UART5 Receive Done
     * 181 - UART5 Transfer Done
     * 182 - I2C5 Bus Collision Event
     * 183 - I2C5 Slave Event */
    IPC(45) = PIC32_IPC_IP0(5) | PIC32_IPC_IP1(5) | PIC32_IPC_IP2(0) | PIC32_IPC_IP3(0);

